---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPath.TextOrientation
source: html/713815e5-ca17-cb05-bb41-026af4c9c77f.htm
---
# Autodesk.Revit.DB.Architecture.StairsPath.TextOrientation Property

The orientation of stair up and down text.

## Syntax (C#)
```csharp
public StairsTextOrientation TextOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration